app/controllers/movies_controller.rb

  def index
		@all_ratings = Movie.all_ratings
    @filtered_ratings = Movie.all_ratings
    #session[:filtered_ratings] = Movie.all_ratings
    if params[:ratings] != nil
      @filtered_ratings = []
      params[:ratings].each do |k,v|
        if v == "1"
          @filtered_ratings << k
        end
      end


      #@filtered_ratings = params[:ratings].where(
    else
      params[:ratings] = {"G" => "1", "PG" => "1", "PG-13" => "1", "R" => "1", "NC-17" => "1"}
    end

    sort = params[:sort]
    if sort == 'title'
      @movies = Movie.order("lower(title) ASC").all
    elsif sort == 'date'
      @movies = Movie.all.sort_by &:release_date
    else
      @movies = Movie.find(:all, :conditions => ["rating IN (?)", @filtered_ratings])
    end
  end

  def new
    # default: render 'new' template
  end

  def create
    @movie = Movie.create!(params[:movie])
    flash[:notice] = "#{@movie.title} was successfully created."
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN (NULL) ORDER BY lower(title) ASC
SELECT "movies".* FROM "movies" ORDER BY lower(title) DESC
INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)